{
  "projects": [
    {
      "projectBanner": "./static/projectImg/netflixBanner.png",
      "projectName": "Netflix Clone",
      "vidLink": "",
      "demoLink": "https://netflix-clone-gilt-eight.vercel.app/",
      "githubLink": "https://github.com/Rich4ever11/Netflix-Clone",
      "description": "I have successfully developed and deployed a captivating web application, akin to the user experience offered by Netflix. This cutting-edge creation leverages a dynamic blend of technologies, including Youtube's API, Magic Link, Next.js, and other innovative tools. Currently, I am actively involved in further refining and enhancing its functionalities.",
      "languagesUsed": [
        "Nextjs",
        "React",
        "Typescript",
        "CSS",
        "Hasura",
        "Magic Link",
        "Vercel",
        "JWT"
      ]
    },
    {
      "projectBanner": "./static/projectImg/vuln-scanning.png",
      "projectName": "Port & Vulnerability Scanner",
      "vidLink": "https://drive.google.com/file/d/13LvBGpZYm_eBItnQJ63rgHvHxuuJHHE1/view?usp=sharing",
      "demoLink": "",
      "githubLink": "https://github.com/UMBC-CMSC437-SP2023/project-the-richest",
      "description": "I've developed and published a user-friendly GUI application for scanning remote system ports and detecting vulnerabilities. It includes built-in search functionality for finding specific CVEs and supports comprehensive IPv4 address scans. Integration with CVE databases provides insights into affected software products and exploit methods. My project delivers an effective tool for enhancing security on remote systems.",
      "languagesUsed": ["C#", "Visual Studio", "Windows Forms"]
    },
    {
      "projectBanner": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Flag_of_Maryland.svg",
      "projectName": "Maryland Forum",
      "vidLink": "https://drive.google.com/file/d/1tB9FKjhT9QH5MKXS7xNo8Cj1gEa8iJlk/view?usp=sharing",
      "demoLink": "",
      "githubLink": "",
      "description": "I have successfully delivered an impressive CRUD application, serving as an exclusive open forum for Maryland students and alumni. This cutting-edge platform empowers users to create, edit, and delete their own posts, while also engaging with a diverse range of threads on various topics. Leveraging Next.js, Tailwind CSS, and a secure MySQL backend, I have crafted a seamless and visually captivating user interface. With strong skills in frontend development, backend implementation, and database management, this project showcases my ability to create innovative, user-centric applications with a keen focus on data security and exceptional user experience.",
      "languagesUsed": [
        "Nextjs",
        "React",
        "Tailwind CSS",
        "MySQL",
        "Vercel",
        "Git"
      ]
    },
    {
      "projectBanner": "https://upload.wikimedia.org/wikipedia/commons/7/77/Flag_of_Baltimore%2C_Maryland.svg",
      "projectName": "Baltimore City Covid & Crime Tracker",
      "vidLink": "",
      "demoLink": "",
      "githubLink": "https://github.com/Rich4ever11/Baltimore-City-Crime-and-Covid-Web-App",
      "description": "I led the development of a cutting-edge web application that delivers real-time insights on crime and COVID-19 cases in Baltimore City. Through visually captivating maps, heatmaps, and graphs, users can effortlessly explore and analyze data. Leveraging React, Material UI, Leaflet, and Graph.js on the front-end, and SQLAlchemy with Flask on the back-end, I ensured a seamless user experience with secure and efficient data management. This project showcases my expertise in full-stack development, UI/UX design, and delivering impactful solutions for complex data-driven challenges.",
      "languagesUsed": ["React", "Flask", "SQL alchemy"]
    },
    {
      "projectBanner": "./static/projectImg/connect4.png",
      "projectName": "Connect Four Within The C Kernel",
      "vidLink": "https://drive.google.com/file/d/1YVrW3Ka5hssv7LOW6V4QM_XrmaAY0FL-/view?usp=sharing",
      "demoLink": "",
      "githubLink": "https://github.com/UMBC-CMSC421-FA2022/project3-Rich4ever11",
      "description": "I developed a custom Kernel Module for an exciting game of Connect Four, allowing users to play against a computer opponent. It features a reset option, selectable game pieces, and a robust win/lose/draw checking mechanism. To ensure thread safety, I implemented a mutex lock system, enabling seamless operation even with multiple concurrent users. This project highlights my expertise in low-level programming, game development, and concurrent systems, showcasing my ability to deliver engaging and secure solutions.",
      "languagesUsed": ["C", "Batch Files"]
    },
    {
      "projectBanner": "./static/projectImg/passGenBG.avif",
      "projectName": "Password Generator",
      "vidLink": "",
      "demoLink": "",
      "githubLink": "https://github.com/Rich4ever11/Password_Generator",
      "description": "The QT Password Generator is a sleek and user-friendly GUI application developed using the Qt framework. With its intuitive interface, users can effortlessly generate strong and secure passwords. The application allows customization of password criteria, including length and character types. It employs a robust randomization algorithm to ensure each password is unique and difficult to guess. Users can easily copy generated passwords to the clipboard and benefit from a password strength indicator. The lightweight and cross-platform nature of the application make it a convenient tool for protecting sensitive information across various operating systems.",
      "languagesUsed": ["C++", "Qt"]
    },
    {
      "projectBanner": "./static/projectImg/vueBanner.png",
      "projectName": "Vue Forum",
      "vidLink": "",
      "demoLink": "https://friendly-crumble-33f5e8.netlify.app/",
      "githubLink": "https://github.com/Rich4ever11/vueforum",
      "description": "Vue Forum is a dynamic online platform powered by Vue.js, designed to facilitate collaboration and knowledge-sharing among Vue.js enthusiasts. It provides a vibrant community where users can connect, learn, and grow together. With its user-friendly interface and responsive design, Vue Forum offers an intuitive experience across devices. Engage in discussions, ask questions, and gain valuable insights from fellow members. Join the Vue Forum community to explore, contribute, and expand your understanding of Vue.js and related topics.",
      "languagesUsed": ["Vuejs", "Firebase"]
    },
    {
      "projectBanner": "./static/projectImg/redditBanner.jpg",
      "projectName": "Reddit Clone",
      "vidLink": "",
      "demoLink": "",
      "githubLink": "",
      "description": "Currently Working on a clone of the famouse web application Reddit. It will contain all the features of the famous web application",
      "languagesUsed": ["Nextjs", "ChakraUI"]
    }
  ]
}
